
invasion = '''Однажды в мире еще днем бурлила прекрасная, обыденная жизнь, но уже ночью все изменилось: непонятно 
откуда появились человекоподобные 3-ех метровые существа- темные. Ночью они пришли в город и стали сеять в нем ад.
напишите на кнопку, чтобы начать первую компанию.'''


invasion0="""1 Кампания.

Ночью ты в суматохе забежал на чердак и просидел там всю ночь. Весь следующий день ты проспал и проснулся только тогда, когда уже стало вечереть. Темные уже успели уйти из \
города, поскольку ты не слышал никаких звуков на улице, потому ты сделал вывод о том, что они выходят на охоту ночью.
Что будешь делать?
1. Пойти в квартиру за едой и водой.
2. Выйти на улицу и попытаться найти выживших.
3. Остаться на крыше и дождаться конца ночи.
"""

invasion1_1="""1. Ты решил пойти в квартиру за едой. Когда ты зашел туда, ты увидел там идеальный порядок, такой же, какой был до твоего ухода. Взяв еду ты выглянул в окно и увидел \
трупы людей, у которых на лице застыл ужас. Ты не стал задерживаться и снова поднялся на чердак. Скоро снова стемнело и послышались шаги темных в твоем подьезде.
Что будешь делать?
1. Попытаться вылезти на крышу и перебраться на крышу соседнего дома.
2. Остаться в чердаке и затаиться.
"""

invasion1_2="""2. Ты вышла на улицу и осмотрелась. На улице валялись трупы людей с перешошенными от ужаса лицами. Ты пошла домой и, войдя в квартиру, поразилась тому, что все было \
впорядке. Ты взяла еду и поднялась на чердак. Скоро снова стемнело и послышались шаги темных в твоем подьезде.
Что будешь делать?
1. Попытаться вылезти на крышу и перебраться на крышу соседнего дома.
2. Остаться в чердаке и затаиться.
"""

invasion1_3="""3. Ты решила остаться на крыше. Скоро твое люпопытство тебя переиграло и ты выглянула через небольшое окно. Ты увидела трупы людей с перекошенными от ужаса лицами и \
предпочла не выходить из дома и дальше. Скоро снова стемнело и послышались шаги темных в твоем подьезде.
Что будешь делать?
1. Попытаться вылезти на крышу и перебраться на крышу соседнего дома.
2. Остаться в чердаке и затаиться.
"""

invasion2_1="""1. Ты решила, что не стоит оставаться на чердаке и вылезла на крышу. Крыша другого дома находилась не так уж и далеко, потому ты решила допрыгнуть до нее. \
Ты разогналась и прыгнула, но немного не долетела и зацепилась за край руками. Ты начала подтягиваться, но почувствовала резкую головную боль и стала видеть страшные и \
непонятные видения. С трудом ты забралась на крышу и заскачила на чердак, после чего боль стихла. Ты слышала какие то шаги в подьезде, но никто на чердак не залез, потому ты \
спокойно дождалась утра и продремала до обеда. Проснувшись ты почувствовала сильный голод и жажду, но на чердаке ты ничего не нашла.
Что будешь делать дальше?
1. Спуститься в квартиры и попробовать их осмотреть.
2. Выйти на улицу и попробовать осмотреть машины.
3. Попробовать перепрыгнуть назад на свой чердак.
"""

invasion2_2="""2. Ты решила, что стоит остаться на чердаке, но скоро послышались удары в крышку люка и ты решила уходить. Крыша другого дома находилась не так уж и далеко, потому \
ты решила допрыгнуть до нее. Ты разогналась и прыгнула, но немного не долетела и зацепилась за край руками. Ты начала подтягиваться, но почувствовала резкую головную боль и \
стала видеть страшные и непонятные видения. С трудом ты забралась на крышу и заскачила на чердак, после чего боль стихла. Ты слышала какие то шаги в подьезде, но никто на \
чердак не залез, потому ты спокойно дождалась утра и продремала до обеда. Проснувшись ты почувствовала сильный голод и жажду, но на чердаке ты ничего не нашла.
Что будешь делать дальше?
1. Спуститься в квартиры и попробовать их осмотреть.
2. Выйти на улицу и попробовать осмотреть машины.
3. Попробовать перепрыгнуть назад на свой чердак.
"""

invasion3_1="""1. Ты решила спуститься в квартиру. Ты выбрала квартиру на последнем этаже и оказалось, что дверь была открыта. Внутри ты не нашла следов чьего то присуствия и \
принялась есть еду из холодильника. Когда ты наелась и написалась то сразу же отрубилась и проснулась уже ночью от звуков ходьбы за дверью. Ты быстро залезла в шкаф и в квартиру \
кто то вошел. По звуку ходьбы ты поняла, что это был темный. Ты спряталась в детской комнате и он почему то сразу вошел в нее. На полу лежали детские книжки и рисунки. \
Он принялся их осматривать с интересом. Он смотрел на книжки около получаса и удалился. Ты так и заснула в том шкафу и проснулась уже утром.
Что будешь делать?
1. Пойти в полицейский участок и попытаться достать там оружие.
2. Пойти в супермаркет и достать там еды.
3. Пойти по улице громко крича и пытаясь найти выживших.
"""

invasion3_2="""2. Ты пошла осматривать машины. Выйдя на улицу ты обратила внимание на то, что на ней нет ни души и вчерашние трупы куда то пропали. Ты залезла в первую попавшуюся \
машину и нашла там рюкзак с едой и водой. Ты наелась и напилась, после чего уснула. Ты проснулась уже ночью и услышала, что кто то идет к машине. Поскольку ты залезла в джип \
из его кабины был доступ к багажнику и ты залезла туда, накрывшись простыней. Темный нашел в рюкзаке книгу и стал листать ее. Спустя несколько часов он ушел, а ты уснула в \
машине. Проснулась ты уже утром.
Что будешь делать?
1. Пойти в полицейский участок и попытаться достать там оружие.
2. Пойти в супермаркет и достать там еды.
3. Пойти по улице громко крича и пытаясь найти выживших.
"""

invasion3_3="""3. Ты решила перепрыгнуть назад на свой чердак, но это было плохой идеей. Ты поскользнулась и полетела камнем вниз с 6 этажа. Но прямо под тобой был чердак и ты \
зацепилась руками за его крышу. К счастью он не был застеклен и ты проникла внутрь квартиры. Внутри ты не нашла следов чьего то присуствия и принялась есть еду из холодильника. \
Когда ты наелась и написалась то сразу же отрубилась и проснулась уже ночью от звуков ходьбы за дверью. Ты быстро залезла в шкаф и в квартиру кто то вошел. По звуку ходьбы ты \
поняла, что это был темный. Ты спряталась в детской комнате и он почему то сразу вошел в нее. На полу лежали детские книжки и рисунки. Он принялся их осматривать с интересом. \
Он смотрел на книжки около получаса и удалился. Ты так и заснула в том шкафу и проснулась уже утром.
Что будешь делать?
1. Пойти в полицейский участок и попытаться достать там оружие.
2. Пойти в супермаркет и достать там еды.
3. Пойти по улице громко крича и пытаясь найти выживших.
"""

invasion4_1="""1. Ты решила обзавестись оружием и пошла в полицейский участок. Ты долго шла, ведь ты не знала где он находится и когда ты его нашла уже стало темнеть. \
По дороге ты никого не встретила. Обыскав весь участок ты так ничего там и не нашла и, взглянув на улицу ты увидела какую то женщину. Она внезапно схватилась за голову и упала \
и ты заметила темного, стоящего поблизости и внимательно ее рассматривающего.
Что будешь делать?
1. Помочь ей.
2. Проигнорировать и постараться спрятаться.
"""

invasion4_2="""2.Ты решила запастись едой в супермаркете. Ты долго шла и осмотрела много магазинов, но все они были пусты и когда ты нашла не пустой уже стемнело. \
По дороге ты никого не встретила. Обыскав весь супермаркет ты нашла немного еды и, взглянув на улицу ты увидела какую то женщину. Она внезапно схватилась за голову и упала и \
ты заметила темного, стоящего поблизости и внимательно ее рассматривающего.
Что будешь делать?
1. Помочь ей.
2. Проигнорировать и постараться спрятаться.
"""

invasion4_3="""3. Ты решила пойти искать людей. Ты долго ходила по улицам и звала выживших, но никто так и не откликнулся. Ты зашла в какой то подьезд и увидела женщину на улице. \
Она внезапно схватилась за голову и упала и ты заметила темного, стоящего поблизости и внимательно ее рассматривающего.
Что будешь делать?
1. Помочь ей.
2. Проигнорировать и постараться спрятаться.
"""

invasion5_1="""1. Ты решила ей помочь, выбежала на улицу, но упала от головной боли. Ты уже думала что тоже не встанешь, но раздался снайперский выстрел и темный упал. \
Ты побежала к женщине, но она была мертва. Ты огляделось и увидела, как к тебе идут какие то вооруженные люди.
Что будешь делать дальше?
1. Бежать.
2. Подождать пока они подойдут.
"""

invasion5_2="""2. Ты решила спрятаться, но темный увидел тебя и ты упала от головной боли. Ты уже думала что тоже не встанешь, но раздался снайперский выстрел и темный упал. \
Ты побежала к женщине, но она была мертва. Ты огляделось и увидела, как к тебе идут какие то вооруженные люди.
Что будешь делать дальше?
1. Бежать.
2. Подождать пока они подойдут.
"""

invasion6_1="""1. Ты решила бежать и правильно сделала. ПО тебе начали стрелять и ты успела спрыгнуть в канализацию. Ты услышала, что они тоже спускаются за тобой.
Что будешь делать?
1. Сдаться.
2. Бежать по тоннолю.
"""

invasion6_2="""2. Ты решила подождать, но по тебе начали стрелять и ты успела спрыгнуть в канализацию. Ты услышала, что они тоже спускаются за тобой.
Что будешь делать?
1. Сдаться.
2. Бежать по тоннолю.
"""

invasion7_1="""1. Ты испугалась и решила сдаться. Тебя скрутили и связали. Ты начала думать, что это конец, но услушала звуки подьезжающей машины. \
Кто то открыл люк и начал стрелять по бандитам, благодаря чему ты смогла сбежать в какой то из тоннелей. Через время выстрелы стихли.
Что будешь делать?
1. Пойти назад и посмотреть что случилось.
2. Спрятаться.
"""

invasion7_2=""" 2. Ты попыталась сбежать, но тебя поймали, скрутили и связали. Ты начала думать, что это конец, но услушала звуки подьезжающей машины. \
Кто то открыл люк и начал стрелять по бандитам, благодаря чему ты смогла сбежать в какой то из тоннелей. Через время выстрелы стихли.
Что будешь делать?
1. Пойти назад и посмотреть что случилось.
2. Спрятаться.
"""

invasion8_1="""1. Ты пошла назад. Оказалось что военные перебили бандитов. Они отвезли тебя в защищенный город и ты наконец смогла почувствовать себя в безопасности.
Чтобы начать прохождение 2 компании, нажмите кнопку
"""

invasion8_2="""1. Ты спряталась, но тебя все равно нашли. Оказалось что военные перебили бандитов и пошли искать тебя. Они отвезли тебя в защищенный город и ты наконец \
смогла почувствовать себя в безопасности.
Чтобы начать прохождение 2 компании, нажмите кнопку
"""

invasion2="""2 Кампания

Ночью ты шел по улице бухов в говн.... после веселого вечера в баре и резко стал слышать крики людей. Оглядевшись ты увидел каких то странных темных существ.
Что будешь делать?
1. Спрятаться в подвале.
2. Забежать в подъезд.
3. Побежать на тварей с кулаками.
"""

invasion2_1_1="""1. Ты забежал в подвал и спрятался за какой то дверью. Ты слышал крики до самого утра и осмелился выйти через несколько часов после того, как они стихли. \
Ты увидел хаос в городе. По громкоговорителям обьявили о начале эвакуации в большие населенные пункты. Нужно было идти к главной площади по улицам, усеянными трупами. \
Ты дошел до места и увидел потрепанные временем автобусы. Собирались люди долго и доехали вы до города уже ближе к вечеру. Весь город был утыкан пулеметными позициями и \
укреплениями. Ночь уже наступала и ты увидел, как людей агитируют вступать в оборону.
Что будешь делать?
1. Пойти добровольцем.
2. Пройти мимо.
"""

invasion2_1_2="""2. Ты забежал в подьезд и захлопнул дверь. Ты слышал крики до самого утра и осмелился выйти через несколько часов после того, как они стихли. Ты увидел хаос в городе. \
По громкоговорителям обьявили о начале эвакуации в большие населенные пункты. Нужно было идти к главной площади по улицам, усеянными трупами. Ты дошел до места и увидел \
потрепанные временем автобусы. Собирались люди долго и доехали вы до города уже ближе к вечеру. Весь город был утыкан пулеметными позициями и укреплениями. Ночь уже наступала \
и ты увидел, как людей агитируют вступать в оборону.
Что будешь делать?
1. Пойти добровольцем.
2. Пройти мимо.
"""

invasion2_1_3="""3. Ты побежал на тварь, но почувствовал боль в голове и упал. Ты умер спустя несколько минут.

Продумывая все это в голове ты понял, что так делать не следует.
Что будешь делать?
1. Спрятаться в подвале.
2. Забежать в подьезд.
"""

invasion2_2_1="""1. Ты решил пойти добровольцем, поскольку ты являешься военным в отставке. Тебе выдали автомат и отправили на позицию, ожидать атаки. Скоро темные появились и вы \
стали отбиваться. Вы отстреливались всю ночь и понесли серьезные потери. Выжившие описывали, что они будто бы копаются у них в головах. Вы отбивались от атак еще несколько \
дней и тебя, как отличившегося бойца решили отправить на важное задание. Было необходимо найти карту в каком то тайнике в городе, из которого ты был эвакуирован. Утром вы \
отправились в путь, но внезапно, посередине дороги наступила ночь и вы увидели темных впереди.
Что будешь делать?
1. Бежать в лес.
2. Отстреливаться до последнего.
3. Застрелиться.
"""

invasion2_2_2="""2. Ты хотел пройти мимо, но тебя подозвали. Ты был военным в отставке, потому тебе было стыдно отказываться. Тебе выдали автомат и отправили на позицию, ожидать \
атаки. Скоро темные появились и вы стали отбиваться. Вы отстреливались всю ночь и понесли серьезные потери. Выжившие описывали, что они будто бы копаются у них в головах. \
Вы отбивались от атак еще несколько дней и тебя, как отличившегося бойца решили отправить на важное задание. Было необходимо найти карту в каком то тайнике в городе, из \
которого ты был эвакуирован. Утром вы отправились в путь, но внезапно, посередине дороги наступила ночь и вы увидели темных впереди.
Что будешь делать?
1. Бежать в лес.
2. Отстреливаться до последнего.
3. Застрелиться.
"""

invasion2_3_1="""1. Ты испугался и выпрыгнув из машины побежал в лес. Ты долго бежал и выбился из сил. Ты огляделся и увидел темных. Они подходили к тебя и ты слышал слово "мир" \
в своей голове, пока не отключился от головной боли.

Очнулся ты в своей машине, как оказалось это был сон. В одном из боев ты попал под влияние темных и из за этого тебе почудилось какое то видение. Ты быстро выкинул его из головы. \
Вы подьехали к городу и вышли у нужного вам места-канализационного люка, ведущего в тот тайник. В него спускались бандиты, поэтому вам пришлось прорываться с боем. \
Там вы нашли девушку и карту.  Вы поехали назад, но стало темнеть, на этот раз по настоящему.
Что будешь делать?
1. Спрятаться где то в лесу.
2. Ехать напролом до города.
3. Засесть на ближайшей заправке.
"""

invasion2_3_2="""2. Ты решил отбиваться до последнего, но твоих товарищей быстро перебили. Ты остался один и они стали медленно подбираться к тебе, а у тебя кончились патроны. \
Они подходили к тебя и ты слышал слово "мир" в своей голове, пока не отключился от головной боли.

Очнулся ты в своей машине, как оказалось это был сон. В одном из боев ты попал под влияние темных и из за этого тебе почудилось какое то видение. Ты быстро выкинул его из головы. \
Вы подьехали к городу и вышли у нужного вам места-канализационного люка, ведущего в тот тайник. В него спускались бандиты, поэтому вам пришлось прорываться с боем. \
Там вы нашли девушку и карту.  Вы поехали назад, но стало темнеть, на этот раз по настоящему.
Что будешь делать?
1. Спрятаться где то в лесу.
2. Ехать напролом до города.
3. Засесть на ближайшей заправке.
"""

invasion2_3_3="""3. Ты решил застрелиться, но когда ты пустил пулю себе в затылок, ты услышал слово "мир" в голове.

Очнулся ты в своей машине, как оказалось это был сон. В одном из боев ты попал под влияние темных и из за этого тебе почудилось какое то видение. Ты быстро выкинул его из головы. \
Вы подьехали к городу и вышли у нужного вам места-канализационного люка, ведущего в тот тайник. В него спускались бандиты, поэтому вам пришлось прорываться с боем. \
Там вы нашли девушку и карту.  Вы поехали назад, но стало темнеть, на этот раз по настоящему.
Что будешь делать?
1. Спрятаться где то в лесу.
2. Ехать напролом до города.
3. Засесть на ближайшей заправке.
"""

invasion2_4_1="""1. Вы решили спрятаться в лесу. Спустя пару часов на горизонте появились темные и вы стали отбиваться. Ты стал слышать "не давайте им карту". \
Вы отбивались до утра и потеряли половину отряда, но ты и ты девушка остались живы. Вы вернулись на базу и вам выдали еще бойцов, девушку пристроили куда надо, а тебя назначили \
командиром. Вам дали новое задание-необходимо было добраться до бункера с ядерным оружием, отмеченным на той карте, и запустить ядерные боеголовки в логова темных. Вы \
отправились на его выполнение на нескольких БТРах. Путь был не близким и на половине пути уже начало темнеть. Невдалеке вы заметили множество темных.
Что будете делать?
1. Ехать вперед на таран.
2. Занять обороны и отбиваться.
"""

invasion2_4_2="""2. Вы решили ехать до города напролом. Ближе к городы на вас напали темные, ты стал слышать в голове "не давайте им карту" пока вы с трудом не добрались \
до безопасного места. Половина отряда погибла, но вы с той девушкой выжили. Вы вернулись на базу и вам выдали еще бойцов, девушку пристроили куда надо, а тебя назначили \
командиром. Вам дали новое задание-необходимо было добраться до бункера с ядерным оружием, отмеченным на той карте, и запустить ядерные боеголовки в логова темных. \
Вы отправились на его выполнение на нескольких БТРах. Путь был не близким и на половине пути уже начало темнеть. Невдалеке вы заметили множество темных.
Что будете делать?
1. Ехать вперед на таран.
2. Занять обороны и отбиваться.
"""

invasion2_4_3="""3. Вы решили спрятаться на заправке. Спустя пару часов на горизонте появились темные и вы стали отбиваться. Ты стал слышать "не давайте им карту". Вы отбивались \
до утра и потеряли половину отряда, но ты и ты девушка остались живы. Вы вернулись на базу и вам выдали еще бойцов, девушку пристроили куда надо, а тебя назначили командиром. \
Вам дали новое задание-необходимо было добраться до бункера с ядерным оружием, отмеченным на той карте, и запустить ядерные боеголовки в логова темных. Вы отправились на его \
выполнение на нескольких БТРах. Путь был не близким и на половине пути уже начало темнеть. Невдалеке вы заметили множество темных.
Что будете делать?
1. Ехать вперед на таран.
2. Занять обороны и отбиваться.
"""

invasion2_5_1="""1. Вы решили ехать вперед, тараня темных. Вы пробили нескольких и поехали вперед, отстреливаясь от противника. Ты опять слышал в голове темных. Они говорили \
"мы остановим вас" Ехать ночью вблизи темных было не лучшей идеей, поэтому часть боевых машин слетела с дороги из за влияния темных и разбилась. Но вы смогли оторваться и, \
немного отдохнув утром продолжили путь. К следующей ночи вы уже были у того самого бункера. Темные уже были рядом.
Что будешь делать дальше?
1. Идти напролом в бункер.
2. Отбиваться от них у входа, не пытаясь пробиться в бункер.
"""

invasion2_5_2="""2. Вы решили занять оборону. Ты снова слышал в голове темных. Они говорили "мы остановим вас". Вы отбивались до утра и потеряли часть бойцов, но уцелели и \
поехали дальше. К следующей ночи вы уже были у того самого бункера. Темные уже были рядом.
Что будешь делать дальше?
1. Идти напролом в бункер.
2. Отбиваться от них у входа, не пытаясь пробиться в бункер.
"""

invasion2_6_1="""1.Ты решил, что нужно идти напролом. Темные поняли ваш план и стали отходить в бункер. Вы зашли и стали продвигаться вглубь. Темные все говорили тебе \
"ты делаешь неправильный выбор". Вам надо было спуститься на 3 этажа вниз.
Что будешь делать дальше?
1. Поехать на лифте.
2. Спускаться по лестнице.
"""

invasion2_6_2="""2. Ты решил, что надо сначала перебить всех темных и потом идти в бункер. Темные поняли ваш план и стали отходить в него. Вы зашли и стали продвигаться вглубь. \
Темные все говорили тебе "ты делаешь неправильный выбор". Вам надо было спуститься на 3 этажа вниз.
Что будешь делать дальше?
1. Поехать на лифте.
2. Спускаться по лестнице.
"""

invasion2_7_1="""1. Поскольку лестница не выглядела прочной, вы выбрали лифт.Лифт застрял спустя полтора этажа и вам пришлось выбираться. В это время напали темные и перебили \
большую часть отряда, но сами понесли потери.
Что делать дальше?
1. Попробовать починить лифт.
2. Спустится через тех. помещения.
"""

invasion2_7_2="""2. Вы выбрали лестницу, но она обвалилась, похоронив нескольких бойцов.Вы поехали на лифте, но он застрял спустя полтора этажа и вам пришлось выбираться. \
В это время напали темные и перебили большую часть отряда, но сами понесли потери.
Что делать дальше?
1. Попробовать починить лифт.
2. Спустится через тех. помещения.
"""

invasion2_8_1="""1. Вы смогли починить лифт и добрались до нужного этажа. Темные ждали вас, поэтому начался бой. Вы долго сражались и темные все говорили тебе \
"ты делаешь неправильный выбор". Вы смогли перебить всех, но ты один выжил. Ты  активировал систему и стал вводить координаты целей. Вот ты уже закончил и приготовился \
запускать ракеты, как вдруг........
Для начала 3 компании нажмите на кнопку
"""

invasion2_8_2="""2. Вы нашли тех. спуск и спустились по нему до нужного этажа. Темные ждали вас, поэтому начался бой. Вы долго сражались и темные все говорили тебе \
"ты делаешь неправильный выбор". Вы смогли перебить всех, но ты один выжил. Ты  активировал систему и стал вводить координаты целей. Вот ты уже закончил и приготовился \
запускать ракеты, как вдруг........
Для начала 3 компании нажмите на кнопку
"""

invasion3="""3 Кампания.

Ночью ты в суматохе спряталась в багажнике какой то машины и тебя не заметили. На утро ты увидела улицы, усеянные трупами людей и решила, что лучше поехать в лес и спрятаться \
там. Ты так и сделала. На пол пути ты отключилась и проснулась уже вечером, когда началось темнеть. Недавно ты проезжала мимо деревни, а вдалеке виднелась заправка
Что будешь делать?
1. Бросить машину и спрятаться в лесу.
2. Спрятаться в деревне.
3. Спрятаться на заправке.
"""

invasion3_1_1="""1. Ты решила спрятаться в лесу и побежала. Ты нашла какую то яму и залезла туда накрывшись листвой. Ты слышала какие то шаги рядом с собой, но не осмелилась \
проверить кто там и уснула. Проснулась ты уже днем.
Что будешь делать?
1. Проверить деревню.
2. Проверить заправку.
"""

invasion3_1_2="""2. Ты решила спрятаться в деревне и побежала туда. Ты нашла какой то дом и спряталась там в шкаф. Ты видела, как темный зашел в дом и стал осматриваться. \
Он внимательно все изучил и ушел, а ты уснула. Проснулась ты уже днем.
Что будешь делать?
1. Проверить деревню.
2. Проверить заправку.
"""

invasion3_1_3="""3. Ты решила спрятаться на заправке и побежала туда. Ты нашла там шкаф и спряталась в нем. Темный зашел на заправку и внимательно все осмотрел, а ты уснула. \
Проснулась ты уже днем.
Что будешь делать?
1. Проверить деревню.
2. Проверить заправку.
"""

invasion3_2_1="""1. Ты осмотрела деревню и нашла в ней немного еды и воды. Этого тебе хватит на несколько дней. Так же ты нашла там лесной маскировочный костюм,это была хорошая \
находка. Ты решила проверить заправку и нашла там снайперскую винтовку.
Что будешь делать дальше?
1. Остаться жить в деревне на какое то время.
2. Пойти путешествовать по лесу и дорогам на машине.
3. Остаться на заправке.
"""

invasion3_2_2="""2. Ты осмотрела заправку и нашла в ней снайперскую винтовку. Ты решила поискать что то в деревне и нашла там немного еды и воды, а так же маскировочный костюм.
Что будешь делать дальше?
1. Остаться жить в деревне на какое то время.
2. Пойти путешествовать по лесу и дорогам на машине.
3. Остаться на заправке.
"""

invasion3_3_1="""1. Ты решила остаться жить в деревне, но первая же ночь заставила тебя отказаться от этой идеи. Ты уже укладывалась спать на чердаке, но услышала шум рядом с домом. \
Выглянув в окно ты увидела вооруженных людей. Они тебя заметили, схватили и связали. Скоро на бандитов напали темные, поэтому тебе нужно было действовать.
Что будешь делать?
1. Попытаться спрятаться.
2. Бежать.
"""

invasion3_3_2="""2. Ты решила путешествовать на машине и, вдоволь заправившись, поехала куда то. Когда стало темнеть, тебя остановили какие то вооруженные люди, схватили и связали. \
Однако скоро на бандитов напали темные, поэтому тебе нужно было действовать.
1. Попытаться спрятаться.
2. Бежать.
"""

invasion3_3_3="""3. Ты решила остаться на заправке, но первая же ночь заставила тебя отказаться от этой идеи. Ты уже укладывалась спать, но услышала шум рядом со своим новым домом. \
Выглянув в окно ты увидела вооруженных людей. Они тебя заметили, схватили и связали. Скоро на бандитов напали темные, поэтому тебе нужно было действовать.
1. Попытаться спрятаться.
2. Бежать.
"""

invasion3_4_1="""1. Ты решила, что стоит спрятаться. Это спасло тебя и, когда все стихло, ты решила поехать в город, искать выживших. Ты осуществила задуманное и набрала еды в \
ближайшем супермаркете, но начало темнеть и ты спряталась в ближайшем доме. Ты решила выглянуть в окно и увидела, как темный убивает какую то девушку. Ты не смогла остаться в \
стороне и попыталась его убить. Ты выстрелила и была уверена, что промазала, но темный упал. После этого ты увидела, как на девушку напали те самые бандиты. Ты хотела ей помочь, \
но  услышала дыхание за спиной. Обернувшись, ты увидела темного, которого ты застрелила пару секунд назад.
Что будешь делать?
1. Попробовать застрелить его еще раз.
2. Игнорировать проблему.
3. Бежать.
"""

invasion3_4_2="""2. Ты решила, что стоит бежать. Это спасло тебя и, когда все стихло, ты вернулась к уцелевшей машине и решила поехать в город, искать выживших. Ты осуществила \
задуманное и набрала еды в ближайшем супермаркете, но начало темнеть и ты спряталась в ближайшем доме. Ты решила выглянуть в окно и увидела, как темный убивает какую то девушку. \
Ты не смогла остаться в стороне и попыталась его убить. Ты выстрелила и была уверена, что промазала, но темный упал. После этого ты увидела, как на девушку напали те самые \
бандиты. Ты хотела ей помочь, но  услышала дыхание за спиной. Обернувшись, ты увидела темного, которого ты застрелила пару секунд назад.
Что будешь делать?
1. Попробовать застрелить его еще раз.
2. Игнорировать проблему.
3. Бежать.
"""

invasion3_5_1="""1. Ты попыталась выстрелить, но палец не смог нажать курок. Ты резко почувствовала боль в голове, как будто тебе ее пробила пуля. От нестерпимой боли ты отключилась. \
На утро ты очнулась и увидела машину с какими то вооруженными людьми. Они шли с той девушкой в бронированную машину.
Что будешь делать?
1. Проигнорировать.
2. Проследить за ними.
"""

invasion3_5_2="""2. Ты решила затаиться, но внезапно почувствовала боль в голове, как будто тебе ее пробила пуля. От нестерпимой боли ты отключилась. На утро ты очнулась и увидела \
машину с какими то вооруженными людьми. Они шли с той девушкой в бронированную машину.
Что будешь делать?
1. Проигнорировать.
2. Проследить за ними.
"""

invasion3_5_3="""3. Ты начала убегать, но внезапно почувствовала боль в голове, как будто тебе ее пробила пуля. От нестерпимой боли ты отключилась. На утро ты очнулась и увидела \
машину с какими то вооруженными людьми. Они шли с той девушкой в бронированную машину.
Что будешь делать?
1. Проигнорировать.
2. Проследить за ними.
"""

invasion3_6_1="""1. Ты решила проигнорировать, но не смогла оставить девушку в беде, потому решила проследить за теми людьми. Они поехали на машине куда то, но наступила ночь и они \
стали отбиваться от темных. Ты сидела неподалеку и мимо тебя проходили темные, но они не реагировали на тебя. Когда бойня кончилась люди смогли прорваться и поехали в город. \
Ты запомнила путь и решила вернуться на место боя. Там ты увидела, как темные закапывают в могилы тела убитых людей. Ты посмотрела на это и поехала к тому городу. Ты увидела, \
что город хорошо охраняется системой из баррикад и пулеметных позиций.
Что будешь делать?
1. Пробраться в город и разведать обстановку.
2. Осматривать город снаружи.
"""

invasion3_6_2="""2. Ты не смогла бросить девушку в беде, потому решила проследить за теми людьми. Они поехали на машине куда то, но наступила ночь и они стали отбиваться от темных. \
Ты сидела неподалеку и мимо тебя проходили темные, но они не реагировали на тебя. Когда бойня кончилась люди смогли прорваться и поехали в город. Ты запомнила путь и решила \
вернуться на место боя. Там ты увидела, как темные закапывают в могилы тела убитых людей. Ты посмотрела на это и поехала к тому городу. Ты увидела, что город хорошо охраняется \
системой из баррикад и пулеметных позиций.
Что будешь делать?
1. Пробраться в город и разведать обстановку.
2. Осматривать город снаружи.
"""

invasion3_7_1="""1. Ты решила пробраться в город. Это было непросто и рискованно, но ты пролезла в город через канализацию. Ты попалась и тебя взяли под стражу. Из разговоров охраны \
ты узнала, что девушка попала в хорошие руки и, дождавшись удобного момента, сбежала из города. На рассвете ты увидела группу, двигающуюся куда то. Тебя это заинтересовало и ты \
решила проследить за ними. Ты поехала этим же вечером за ними не отставая и ехала так до ночи, пока снова не начался бой между ними и темными. В твоей голове звучала фраза \
"останови их".
Что будешь делать?
1. Начать стрелять по людям.
2. Начать стрелять по темным.
3. Игнорировать.
"""

invasion3_7_2="""2. Ты решила не рисковать и посмотрела снаружи на город. Через оптику ты видела людей, беззаботно ходящих по городу, потому ты поняла, что та девушка в хороших руках. \
На рассвете На рассвете ты увидела группу, двигающуюся куда то. Тебя это заинтересовало и ты решила проследить за ними. Ты поехала этим же вечером за ними не отставая и ехала \
так до ночи, пока снова не начался бой между ними и темными. В твоей голове звучала фраза "останови их".
Что будешь делать?
1. Начать стрелять по людям.
2. Начать стрелять по темным.
3. Игнорировать.
"""

invasion3_8_1="""1. Ты решила стрелять по людям, но не смогла нажать на спусковой крючок, чтобы убить случайных людей. Бой кончился в пользу людей и ты поехала за ними дальше. \
К следующей ночи они доехали до какого то бункера и снова стали воевать с темными. Они зашли в бункер и тебе пришлось последовать за ними. Ты зашла в бункер.
Что будешь делать дальше?
1.Спустится вниз по лестнице.
2. Проползти вниз по вентиляции.
"""

invasion3_8_2="""2. Ты решила стрелять по темным, но физически не смогла нажать на спусковой крючок. Бой кончился в пользу людей и ты поехала за ними дальше. К следующей ночи они \
доехали до какого то бункера и снова стали воевать с темными. Они зашли в бункер и тебе пришлось последовать за ними. Ты зашла в бункер.
Что будешь делать?
1.Спустится вниз по лестнице.
2. Проползти вниз по вентиляции.
"""

invasion3_8_3="""3. Ты решила игнорировать происходящее и правильно сделала. Бой кончился в пользу людей и ты поехала за ними дальше. К следующей ночи они доехали до какого то \
бункера и снова стали воевать с темными. Они зашли в бункер и тебе пришлось последовать за ними. Ты зашла в бункер.
ЧТо будешь делать?
1.Спустится вниз по лестнице.
2. Проползти вниз по вентиляции.
"""

invasion3_9_1="""1. Ты решила спустится вниз по лестнице. По середине спуска лестница обвалилась и ты оказалась рядом с боем людей и темных. Ты услышала в своей голове "сделай \
правильный выбор!". Ты поняла, что не стоит привлекать к себе лишнее внимание и стала думать, как спуститься ниже.
Что будешь делать?
1. Спустится вниз через тех. проход.
2. Залезть в другую вентилляцию.
"""

invasion3_9_2="""2. Ты сочла лестницу слишком хрупкой, потому полезла по вентилляции. Она кончалась на пол пути и ты вылезла рядом с боем темных и людей. Ты услышала в своей голове \
"сделай правильный выбор!". Ты поняла, что не стоит привлекать к себе лишнее внимание и стала думать, как спуститься ниже.
Что будешь делать?
1. Спустится вниз через тех. проход.
2. Залезть в другую вентилляцию.
"""

invasion3_10_1="""1. Ты вышла на нижний этаж черех тех проход и стала блуждать по нему. Спустя какое то время ты наткнулась на мужика, стоящего у какого то пульта управления. Ты \
направила на него оружие и он обьяснил, что если нажмет на кнопку, то ядерные удары убьют всех темных.
Что будешь делать?
1. Опустить оружие и позволить ему сделать его дело(убить всех темных).
2. Выстрелить в пульт управления(спасти темных).
"""

invasion3_10_2="""2. Ты вылезла на нижний этаж по другой вентилляции и стала блуждать по нему. Спустя какое то время ты наткнулась на мужика, стоящего у какого то пульта управления. \
Ты направила на него оружие и он обьяснил, что если нажмет на кнопку, то ядерные удары убьют всех темных.
Что будешь делать?
1. Опустить оружие и позволить ему сделать его дело(убить всех темных).
2. Выстрелить в пульт управления(спасти темных).
"""

invasion3_11_1="""1. Ты решила уничтожить всех темных. Как оказалось, темные пришли к нам, чтобы дать нам технологии и спасти наш вид, ведь они были разумными гумадоидами-телепатами. \
Они не понимали как взаимодействовать с людьми и убивали их своим телепатическим воздействие. По итогу человечество вымерло не сумев совладать с природой без их помощи.
"""

invasion3_11_2="""2. Ты решила спасти всех темных. Это было правильным решением, ведь темные являлись разумными гуманоидами-телепатами и пришли к нам, чтобы спасти наш вид от \
вымирания, дав нам высокие технологии. Но они не умели с нами взаимодействовать, что и приводило к жертвам По итогу с их помощью человечество смогло совладать с природой и \
выжило.
"""


Invasion = {"0" : {"Text" : [invasion], "options" : ["1"], "buttons": 1},
            "1" : {"Text" : [invasion0], "options" : ["1_1", "1_2", "1_3"], "buttons": 3},
            "1_1" : {"Text" : [invasion1_1], "options" : ["2_1", "2_2"], "buttons": 2},
            "1_2" : {"Text" : [invasion1_2], "options" : ["2_1", "2_2"], "buttons": 2},
            "1_3" : {"Text" : [invasion1_3], "options" : ["2_1", "2_2"], "buttons": 2},
            "2_1": {"Text": [invasion2_1], "options": ["3_1", "3_2", "3_3"], "buttons": 3},
            "2_2": {"Text": [invasion2_2], "options": ["3_1", "3_2", "3_3"], "buttons": 3},
            "3_1": {"Text": [invasion3_1], "options": ["4_1", "4_2", "4_3"], "buttons": 3},
            "3_2": {"Text": [invasion3_2], "options": ["4_1", "4_2", "4_3"], "buttons": 3},
            "3_3": {"Text": [invasion3_3], "options": ["4_1", "4_2", "4_3"], "buttons": 3},
            "4_1": {"Text": [invasion4_1], "options": ["5_1", "5_2"], "buttons": 2},
            "4_2": {"Text": [invasion4_2], "options": ["5_1", "5_2"], "buttons": 2},
            "4_3": {"Text": [invasion4_3], "options": ["5_1", "5_2"], "buttons": 2},
            "5_1": {"Text": [invasion5_1], "options": ["6_1", "6_2"], "buttons": 2},
            "5_2": {"Text": [invasion5_2], "options": ["6_1", "6_2"], "buttons": 2},
            "6_1": {"Text": [invasion6_1], "options": ["7_1", "7_2"], "buttons": 2},
            "6_2": {"Text": [invasion6_2], "options": ["7_1", "7_2"], "buttons": 2},
            "7_1": {"Text": [invasion7_1], "options": ["8_1", "8_2"], "buttons": 2},
            "7_2": {"Text": [invasion7_2], "options": ["8_1", "8_2"], "buttons": 2},
            "8_1": {"Text": [invasion8_1], "options": ["2"], "buttons": 1},
            "8_2": {"Text": [invasion8_2], "options": ["2"], "buttons": 1},
            "2" : {"Text" : [invasion2], "options" : ["2_1_1", "2_1_2", "2_1_3"], "buttons": 3},
            "2_1_1" : {"Text" : [invasion2_1_1], "options" : ["2_2_1", "2_2_2"], "buttons": 2},
            "2_1_2" : {"Text" : [invasion2_1_2], "options" : ["2_2_1", "2_2_2"], "buttons": 2},
            "2_2_1": {"Text": [invasion2_2_1], "options": ["2_3_1", "2_3_2", "2_3_3"], "buttons": 3},
            "2_2_2": {"Text": [invasion2_2_2], "options": ["2_3_1", "2_3_2", "2_3_3"], "buttons": 3},
            "2_3_1": {"Text": [invasion2_3_1], "options": ["2_4_1", "2_4_2", "2_4_3"], "buttons": 3},
            "2_3_2": {"Text": [invasion2_3_2], "options": ["2_4_1", "2_4_2", "2_4_3"], "buttons": 3},
            "2_3_3": {"Text": [invasion2_3_2], "options": ["2_4_1", "2_4_2", "2_4_3"], "buttons": 3},
            "2_4_1": {"Text": [invasion2_4_1], "options": ["2_5_1", "2_5_2"], "buttons": 2},
            "2_4_2": {"Text": [invasion2_4_2], "options": ["2_5_1", "2_5_2"], "buttons": 2},
            "2_4_3": {"Text": [invasion2_4_2], "options": ["2_5_1", "2_5_2"], "buttons": 2},
            "2_5_1": {"Text": [invasion2_5_1], "options": ["2_6_1", "2_6_2"], "buttons": 2},
            "2_5_2": {"Text": [invasion2_5_2], "options": ["2_6_1", "2_6_2"], "buttons": 2},
            "2_6_1": {"Text": [invasion2_6_1], "options": ["2_7_1", "2_7_2"], "buttons": 2},
            "2_6_2": {"Text": [invasion2_6_2], "options": ["2_7_1", "2_7_2"], "buttons": 2},
            "2_7_1": {"Text": [invasion2_7_1], "options": ["2_8_1", "2_8_2"], "buttons": 2},
            "2_7_2": {"Text": [invasion2_7_2], "options": ["2_8_1", "2_8_2"], "buttons": 2},
            "2_8_1": {"Text": [invasion2_8_1], "options": ["3"], "buttons": 1},
            "2_8_2": {"Text": [invasion2_8_2], "options": ["3"], "buttons": 1},
            "3" : {"Text" : [invasion3], "options" : ["3_1_1", "3_1_2", "3_1_3"], "buttons": 3},
            "3_1_1": {"Text": [invasion3_1_1], "options": ["3_2_1", "3_2_2"], "buttons": 2},
            "3_1_2": {"Text": [invasion3_1_2], "options": ["3_2_1", "3_2_2"], "buttons": 2},
            "3_1_3": {"Text": [invasion3_1_3], "options": ["3_2_1", "3_2_2"], "buttons": 2},
            "3_2_1": {"Text": [invasion3_2_1], "options": ["3_3_1", "3_3_2", "3_3_3"], "buttons": 3},
            "3_2_2": {"Text": [invasion3_2_2], "options": ["3_3_1", "3_3_2", "3_3_3"], "buttons": 3},
            "3_3_1": {"Text": [invasion3_3_1], "options": ["3_4_1", "3_4_2"], "buttons": 2},
            "3_3_2": {"Text": [invasion3_3_2], "options": ["3_4_1", "3_4_2"], "buttons": 2},
            "3_3_3": {"Text": [invasion3_3_3], "options": ["3_4_1", "3_4_2"], "buttons": 2},
            "3_4_1": {"Text": [invasion3_4_1], "options": ["3_5_1", "3_5_2", "3_5_3"], "buttons": 3},
            "3_4_2": {"Text": [invasion3_4_2], "options": ["3_5_1", "3_5_2", "3_5_3"], "buttons": 3},
            "3_5_1": {"Text": [invasion3_5_1], "options": ["3_6_1", "3_6_2"], "buttons": 2},
            "3_5_2": {"Text": [invasion3_5_2], "options": ["3_6_1", "3_6_2"], "buttons": 2},
            "3_5_3": {"Text": [invasion3_5_3], "options": ["3_6_1", "3_6_2"], "buttons": 2},
            "3_6_1": {"Text": [invasion3_6_1], "options": ["3_7_1", "3_7_2"], "buttons": 2},
            "3_6_2": {"Text": [invasion3_6_2], "options": ["3_7_1", "3_7_2"], "buttons": 2},
            "3_7_1": {"Text": [invasion3_1_1], "options": ["3_8_1", "3_8_2", "3_8_3"], "buttons": 3},
            "3_7_2": {"Text": [invasion3_1_2], "options": ["3_8_1", "3_8_2", "3_8_3"], "buttons": 3},
            "3_8_1": {"Text": [invasion3_8_1], "options": ["3_9_1", "3_9_2"], "buttons": 2},
            "3_8_2": {"Text": [invasion3_8_2], "options": ["3_9_1", "3_9_2"], "buttons": 2},
            "3_8_3": {"Text": [invasion3_8_3], "options": ["3_9_1", "3_9_2"], "buttons": 2},
            "3_9_1": {"Text": [invasion3_9_1], "options": ["3_10_1", "3_10_2"], "buttons": 2},
            "3_9_2": {"Text": [invasion3_9_2], "options": ["3_10_1", "3_10_2"], "buttons": 2},
            "3_10_1": {"Text": [invasion3_10_1], "options": ["3_11_1", "3_11_2"], "buttons": 2},
            "3_10_2": {"Text": [invasion3_10_2], "options": ["3_11_1", "3_11_2"], "buttons": 2},
            "3_11_1": {"Text": [invasion3_11_1], "buttons": 0},
            "3_11_2": {"Text": [invasion3_11_2], "buttons": 0}
            }

