Liberator0 = '''Однажды русский Евгений осознал, что он заебался жить в разьебанном бараке и срать в дырку в \
падвале, что его заебала пиздить жена тряпками и уже приелся вкус просрочки. Женя решил отправиться на ЭСВЭО, \
чтобы спиздить себе унитаз и привести стиралку, дабы жена наконец перестала считать его бухим чмом. Его Жена \
Анна Шлюрченко одобрила эту идею,ведь вечно бухой муж ее порядком заебал, а компенсация за утрату вечно бухого \
долбаеба еще никому не помешала. На прощание она крикнула любимому мужу, чтобы он не вздумал пропасть безвести. \
Он доехал до Запорожской области и попал в окоп. Асвабадительные влажные мечты о ебании тупых хахвов не сбылись, \
 ведь все твои событыльники разбежались, как только началась стрельба. Ты забежал в блиндаж и сверху послышался \
 крик "э русня выходи нахуй блять" \
Что будешь делать?
1. Выйти и сдаться
2. Выкрикнуть "Э хахвы сука я вас щас выебу нахуй"
'''

Liberator1_1 = '''1. Асвабадитель с хрюканьем вышел и увидел перед собой команду из 6 укропов. Его внимания \
сразу привлек сам Чорный Азовев и он понял, что дело плохо. Азовец угрожающие промычал "Слава Украине" и \
потребовал взглядом ответа. \
Что скажешь?
1. В составе России
2. Героям слава
'''

Liberator1_2 = '''2. Асвободитель выкрикнул свой нахрюк и начал стрелять. Это продлилось не долго. К тебе в \
блиндаж залетела спермошумовая граната, взорвавшись она окрасила тебя в белый цвет и ты упал в обморок от \
осознания того, что у тебя с ебалом. Перед тем как окончательно отключиться ты увидел Чорного Азовца и понял, \
что дело плохо. Очнулся ты в каком то темном помещении привязанный к стулу чем то, пахнущим спермой. Как \
обученный опытом русский алкаш ты решительно нихуя не смог сделать. Спустя пять минут твоих стонов и воплей \
к тебе в комнату зашла какая то ахуенно выглядящая украинка в военной форме. Ты вспомнил, что она заходила \
в твой блиндаж и захотел передернуть на нее. Однако она это заметила и ее мужской бас отбил твое желание. \
Она сказала "я - 5-ый опостол укронацизма боевой транс-либераха-куколд-порридж Амелия, придется мне надеть \
на тебя пояс верности, чтобы ты не наяривал на таких крутых девченок как я!" Ты наконец смог отклеить свою \
жопу от смазанного спермой стула, но так и не успел увернуться от ее мега скилла- удара по яйцам. Ты взвыл \
и улетел к стене. Амелия начала готовить пояс верности к эксплуатации, у тебя осталось совсем мало времени, \
чтобы спасти свои причиндалы. \
Что будешь делать?
1. Нанести сокрушительный ответный удар по ее члену
2. Подбежать и дернуть ее за волосы

'''

Liberator2_1 = '''1. Асвабадитель дико всхрюкнул, после чего последовал удар тебе в ебало штык ножом. Очнулся \
ты в каком то темном помещении привязанный к стулу чем то, пахнущим спермой. Как обученный опытом русский алкаш \
ты решительно нихуя не смог сделать. Спустя пять минут твоих стонов и воплей к тебе в комнату зашла какая то \
ахуенно выглядящая украинка в военной форме. Ты вспомнил, что она заходила в твой блиндаж и захотел передернуть \
на нее. Однако она это заметила и ее мужской бас отбил твое желание. Она сказала "я - 5-ый опостол укронацизма \
боевой транс-либераха-куколд-порридж Амелия, придется мне надеть на тебя пояс верности, чтобы ты не наяривал \
на таких крутых девченок как я!" Ты наконец смог отклеить свою жопу от смазанного спермой стула, но так и не \
успел увернуться от ее мега скилла- удара по яйцам. Ты взвыл и улетел к стене. Амелия начала готовить пояс \
верности к эксплуатации, у тебя осталось совсем мало времени, чтобы спасти свои причиндалы. \
Что будешь делать?
1. Нанести сокрушительный ответный удар по ее члену
2. Подбежать и дернуть ее за волосы
'''

Liberator2_2 = '''1. Асвабадитель похрюкал на украинском, после чего получил порцию сквирта в лицо и отключился. \
Очнулся ты в каком то темном помещении привязанный к стулу чем то, пахнущим спермой. Как обученный опытом русский \
алкаш ты решительно нихуя не смог сделать. Спустя пять минут твоих стонов и воплей к тебе в комнату зашла какая \
то ахуенно выглядящая украинка в военной форме. Ты вспомнил, что она заходила в твой блиндаж и захотел передернуть \
на нее. Однако она это заметила и ее мужской бас отбил твое желание. Она сказала "я - 5-ый опостол укронацизма \
боевой транс-либераха-куколд-порридж Амелия, придется мне надеть на тебя пояс верности, чтобы ты не наяривал на \
таких крутых девченок как я!" Ты наконец смог отклеить свою жопу от смазанного спермой стула, но так и не успел \
увернуться от ее мега скилла- удара по яйцам. Ты взвыл и улетел к стене. Амелия начала готовить пояс верности \
к эксплуатации, у тебя осталось совсем мало времени, чтобы спасти свои причиндалы. \
Что будешь делать?
1. Нанести сокрушительный ответный удар по ее члену
2. Подбежать и дернуть ее за волосы
'''

Liberator3_1 = '''1. Асвабадитель подумал что надо ударить по ее слабому месту, но прогадал. Вместо члена там был \
шип, пропитанный желчью российских патриотов. Этот опасный яд попал в твою ногу и ты отрубился. Очнулся ты в \
кресле, приклеенный вагинальной смазкой. Амелия уже готовилась надеть на тебя пояс верности. \
Что будешь делать?
1. Харкнуть ей в лицо.
2. Начать передергивать.
'''

Liberator3_2 = ''' 2. Асвабадитель резко подбежал и дернул ее за волосы. Она взвыла от жгучей боли, ведь ее волосы \
были приклеены к голове слезами детей бомбасса, и из за воспоминаний о том, как она их собирала, она \
перевозбудилась и стала трястись от неимоверных оргазмов. \
Что сделаешь дальше?
1. Харкнуть ей в лицо.
2. Начать передергивать.
'''

Liberator4_1 = '''1. От твоих вонючих слюней на бошке она не выдержала и отрубилась. Ты был спасен и, покинув \
комнату, направился вперед по коридору. Ты брел по коридору, как вдруг твой путь перегородил какой то укранацист \
с автоматом. Он произнес "я - 4 опостол укронацизма великий поляк-наебник Святоруснюебав, расстрелявший 100500 \
миллионов узких мальчиков в трусиках, приготовься получать пиздюлей" и открыл шквальный огонь по тебе. Ты, как \
великих русский акробат черех жопу сделал кувырок в сторону и завалился на пол без сил. Святоруснюебав подошел \
к тебе и достал большую иглу. Он начал снимать с тебя штаны. \
Что будешь делать?
1. Быстро подрочишь и кончишь Святоруснюебаву на лицо.
2. Ударишь его по яйцам.
'''

Liberator4_2='''2. Асвабадитель начал передергивать, что ей очень не понравилась и она надела на тебя пояс, ловко \
его застегнув. Ты навсегда лишился возможности кончить и она стала ржать. От ржача она потеряла сознание. Ты был \
спасен и, покинув комнату, направился вперед по коридору. Ты брел по коридору, как вдруг твой путь перегородил \
какой то укранацист с автоматом. Он произнес "я - 4 опостол укронацизма великий поляк-наебник Святоруснюебав, \
расстрелявший 100500 миллионов узких мальчиков в трусиках, приготовься получать пиздюлей" и открыл шквальный \
огонь по тебе. Ты, как великих русский акробат черех жопу сделал кувырок в сторону и завалился на пол без сил. \
Святоруснюебав подошел к тебе и достал большую иглу. Он начал снимать с тебя штаны. \
Что будешь делать?
1. Быстро подрочишь и кончишь Святоруснюебаву на лицо.
2. Ударишь его по яйцам.
'''

Liberator5_1='''1. Асвабадитель начал дрочить и Святоруснюебав охуел от такой наглости. Он отшатнулся, \
увернувшись от токсичной спермы, благодаря чему ты смог встать. Святоруснюебав начал \
стрелять по тебе.
Что будешь делать?
1. Сделать ловкий перекат к соседней бочке.
2. Нанести ответный удар спермой.
'''

Liberator5_2='''2. Асвабадитель попытался нанести удар по яйцам Святоруснюебава, но он ловким ударом откинул \
тебя в сторону. Святоруснюебав начал стрелять по тебе. \
Что будешь делать?
1. Сделать ловкий перекат к соседней бочке.
2. Нанести ответный удар спермой.
'''

Liberator6_1='''1. Великий воин попытался сделать кувырок, но снова упал, споткнувшись о снятые штаны. \
Святоруснюебав метким броском пронзил тебе уретру иглой. Она вошла тебе в машонку и ты взвыл от боли. \
Вой оглушил Святоруснюебава и он упал на колени, бросив оружие. Ты подобрал оружие и направил его на поляка. \
Перед тем как великий Асвабадитель его расстрелял, Святоруснюебав успел проговорить, что скоро Чорный Азовец \
поработит всю руснявую нацию и выебет твою мамку, жену и дочь. Ты застрелил его и задумался. На какую то там \
русню даже тебе было насрать, как на жену, но вот дочь и мамка....Их жопы и сиськи были слишком сочными, чтобы \
оставить их Чорному Азовцу. Ты прошел мимо выхода и направился вперед, спасать свою семью и всю русню от \
уничтожения. Ты вошел в какую то комнату, где сидела хохлушка в военной форме, с большими ногтями и утиными \
губами. Присмотревшись, ты понял что это та сисятая и жопастая укропка, которая заходила вместе с черным Азовцем. \
 По всей комнате были развешаны фашисткие кресты, портреты Гитлера, Геббельса и Зеленского в образе фашиста. \
Что будешь делать?
1. Упасть на колени и открыть по ней огонь.
2. Начать наяривать.
'''

Liberator6_2='''1. Великий воин попытался образгать врага спермой, но у него получилось только вымазать в сперме \
свое лицо. Святоруснюебав метким броском пронзил тебе уретру иглой. Она вошла тебе в машонку и ты взвыл от боли. \
Вой оглушил Святоруснюебава и он упал на колени, бросив оружие. Ты подобрал оружие и направил его на поляка. \
Перед тем как великий Асвабадитель его расстрелял, Святоруснюебав успел проговорить, что скоро Чорный Азовец \
поработит всю руснявую нацию и выебет твою мамку, жену и дочь. Ты застрелил его и задумался. На какую тотам \
русню даже Асвабадителю было насрать, как на жену, но вот дочь и мамка....Их жопы и сиськи были слишком сочными, \
чтобы оставить их Чорному Азовцу. Великий русский воин прошел мимо выхода и направился вперед, спасать свою семью \
и всю русню от уничтожения. Ты вошел в какую то комнату, где сидела хохлушка в военной форме, с большими ногтями \
и утиными губами. Присмотревшись, ты понял что это та сисятая и жопастая укропка, которая заходила вместе с \
черным Азовцем. По всей комнате были развешаны фашисткие кресты, портреты Гитлера, Геббельса и Зеленского в \
образе фашиста. \
Что будешь делать?
1. Упасть на колени и открыть по ней огонь.
2. Начать наяривать.
'''

Liberator7_1='''Асвабадитель упал на колени и начать вставать с криком "ЫЫЫЫ сматри как я Расию матушку \
поднимаю! ща вот подниму и выебу тебя тупую шлюху" Хахвуха не оценила такой наглости, встала и со словами" \
Я- 3 опостол укронацизма Наскладахсбоеприпасамикуриловна и сейчас кастрирую тебя, а потом выебу твою доченьку \
у тебя на глазах." Она попала тебе в живот усыпляющим дротиком. Ты очнулся привязанный сполями Гиркина к креслу, \
рядом уже химичила хахвуха и готовилась отрезать тебе яйца, навсегда лишив тебя Асвободительных достоинств. \
Увидев что ты очнулся, она отвлеклась от своих дел и вывела твою дочь. Она связала ей руки и начала сношать \
ее дилдаком у тебя на глазах. \
Что делать?
1. Начать дрочить хуй об стул.
2. Орать что Усраины скоро не будет.
'''

Liberator7_2='''Асвободитель начал дрочить хуй с криком"какая охуенна ты шлюшка, хуй тут блять устоишь" Хахвуха \
не оценила такой наглости, встала и со словами" Я- 3 опостол укронацизма Наскладахсбоеприпасамикуриловна и \
сейчас кастрирую тебя, а потом выебу твою доченьку у тебя на глазах." попала тебе в живот усыпляющим дротиком. \
Ты очнулся привязанный сполями Гиркина к креслу, рядом уже химичила хахвуха и готовилась отрезать тебе яйца, \
навсегда лишив тебя Асвободительных достоинств. Увидев что ты очнулся, она отвлеклась от своих дел и вывела \
твою дочь. Она связала ей руки и начала сношать ее дилдаком у тебя на глазах. \
Что делать?
1. Начать дрочить хуй об стул.
2. Орать что Усраины скоро не будет.
'''

Liberator8_1='''Герой России начал наяривать пиструн на свою отьебанную дилдаком дочь. Это не понравилось хахвухе, \
поэтому она вырубила дочь и приступила к кастрации. Она с усмешкой проткнула первое яйцо и засмеялась. После \
твоих диких воплей она проткнула второе яйцо и начала угарать над тобой. Она долго ржала и потеряла сознания \
от слишком дикого смеха. Ты развязался, оставил свой дочере записку с указанием где выход и с осознанием того \
что больше никогда не потрахаешься побрел дальше. Ты зашел в какую то лабораторию. Очередной укронацист был \
тут как тут. В лаборатории повсюду были развешаны плакаты с пропагандой уничтожения всех узких а в клетках \
сидели дети Донбасса. Ученый в нацисткой униформе времен 2 мировой вышел к тебе со словами "Я- 2 опостол \
укронацизма Руснябиогинацидович и тебе стоит приготовиться с мучительной смерти!" выпустил что то из баночки. \
Что делать?
1. Постараться нивелировать угрозу спермоатаками
2. Уворачиваться от насекомых.
'''

Liberator8_2='''Херой ЫСВЫО начал орать что скоро хахвов не будет. Это не понравилось хахвухе, поэтому она \
вырубила дочь и приступила к кастрации. Она с усмешкой проткнула первое яйцо и засмеялась. После твоих диких \
воплей она проткнула второе яйцо и начала угарать над тобой. Она долго ржала и потеряла сознания от слишком \
дикого смеха. Ты развязался, оставил свой дочере записку с указанием где выход и с осознанием того что больше \
никогда не потрахаешься побрел дальше. Ты зашел в какую то лабораторию. Очередной укронацист был тут как тут. \
В лаборатории повсюду были развешаны плакаты с пропагандой уничтожения всех узких а в клетках сидели дети \
Донбасса. Ученый в нацисткой униформе времен 2 мировой вышел к тебе со словами "Я- 2 опостол укронацизма \
Руснябиогинацидович и тебе стоит приготовиться с мучительной смерти!" выпустил что то из баночки. \
Что делать?
1. Постараться нивелировать угрозу спермоатаками
2. Уворачиваться от насекомых.
'''

Liberator9_1='''Ты начал наяривать хуй, но вспомнил что тебе отрезали яйца и осознал, что потратил время впустую. \
Насекомыми оказались боевые комары-нацисты, они проникли тебе прямо в член и отравили тебе его. Он взорвался, \
а доктор-нацист стал ржать и говорить, что скоро все русские мальчики в трусиках останутся без членов. Ты орал \
от жуткой боли, пока он не вывел из клетки твою мамку и стал трахать ее в жопу. \
Что будешь делать?
1. Кинуть в хахлонацика остатки своего члена
2. Начать наяривать остатки хуя на булки своей матери
'''

Liberator9_2='''Ты начал увоорачиваться от них, пока не понял, что это бесполезно. Насекомыми оказались боевые \
комары-нацисты, они проникли тебе прямо в член и отравили тебе его. Он взорвался, а доктор-нацист стал ржать \
и говорить, что скоро все русские мальчики в трусиках останутся без членов. Ты орал от жуткой боли, пока он \
не вывел из клетки твою мамку и стал трахать ее в жопу. \
Что будешь делать?
1. Кинуть в хахлонацика остатки своего члена
2. Начать наяривать остатки хуя на булки своей матери
'''

Liberator10_1='''Ты кинул ошметки своего пиструна в нацика, но он увернулся. Твоя мать смогла сбежать и добралась \
до выхода, что сильно разозлило доктора. Он направил на тебя сороконожек-русофобов. \
Что будешь делать?
1. Полететь на доктора с разгневанным ебалом
2. Включить "Вагнера подьедут" и плясать как долбаеб.
'''

Liberator10_2='''Ты начал наяривать место, где когда то был член. Твоя мать была выебана, но смогла сбежать и \
добралась до выхода, что сильно разозлило доктора. Он направил на тебя сороконожек-русофобов. \
Что будешь делать?
1. Полететь на доктора с разгневанным ебалом
2. Включить "Вагнера подьедут" и плясать как долбаеб.
'''

Liberator11_1='''Асвабадитель побежал на доктора, но поскальзнулся на сороконожке и упал ебалом на нацика, \
вырубив его. С Руснябиогинацидовичем было покончено и сороконжки разбежались, поэтому русский герой хотел \
было перевести дух, но неожиданно стена была проломлена и оттуда показалась большая, страшная и жирная баба. \
Она проорав "Я- 1 опостол укронацизма Фем-Бавовна и сейчас я раздавлю тебе ебало свой большой жопой!" побежала \
в товю сторону. \
Что будешь делать?
1. Попробовать сделать подкат под ней.
2. Отскочить в сторону
'''

Liberator11_2='''Асвободитель врубил какую то хуйню на полную громкость, оттчего все присутствующие попадали \
замертво. С Руснябиогинацидовичем было покончено поэтому русский герой хотел было перевести дух, но неожиданно \
стена была проломлена и оттуда показалась большая, страшная и жирная баба. Она проорав "Я- 1 опостол укронацизма \
Фем-Бавовна и сейчас я раздавлю тебе ебало свой большой жопой!" побежала в товю сторону. \
Что будешь делать?
1. Попробовать сделать подкат под ней.
2. Отскочить в сторону
'''

Liberator12_1='''Герой России прыгнул вниз и, прокатившись ебалом по пополу, ощутил на себе увесистую задницу. \
Она придавила тебя и скомандовала "лижи мою пизду сука руснявая!". Ты покорно подичинился и стал покорно лизать \
ее пизду, пахнующую гавном и кровью деток Донбасса. Она неожиданно повернулась к тебе аналом и скомандовала \
"Вылизывать блять ты узкая!" \
Что будешь делать?
1. Начать покорно лизать.
2. Укусить ее за задницу.
'''

Liberator12_2='''Герой России прыгнул в сторону, но Фем-Бавовна схватила тебя и ты ощутил на себе увесистую \
задницу. Она придавила тебя и скомандовала "лижи мою пизду сука руснявая!". Ты покорно подичинился и стал \
покорно лизать ее пизду, пахнующую гавном и кровью деток Донбасса. Она неожиданно повернулась к тебе аналом \
и скомандовала "Вылизывай блять ты узкая!" \
Что будешь делать?
1. Начать покорно лизать.
2. Укусить ее за задницу.
'''

Liberator13_1='''Герой ЭСВЕО начал покорно лизать ее анал и хавать сваливающееся в рот говно. Ты наглатался \
до тошноты и тебя вырвало прямо ей в жопу. Она не выдержала блевотины руснявого Z-дегенерата и вырубилась. \
Ты хотел было сьебаться нахуй, но решил все же, что должен спасти жену из лап Чорного Азовца. Асвабадитель \
проследовал прямиком в его покои. Чорный Азовец восседал на троне доедал очередного ребенка Донбасса и, как \
только ты потревожил его покой, допил кровь другого ребенка Бомбасса и встал со словами "Ты достойно сражался \
со всеми моими преспешниками и смог победить их. Однако, я НАТОвский Чорный Азовец- из трех маток рожденный, \
а ты какой то деревенский Женек на трех хуях верченый. Я такой Чорный потому что с 16 лет колол боевые \
стимуляторы НАТО, а ты с 16 лет только пиструн свой дрочил на гей порно. Я сру боевым героином НАТО, а ты \
даже срать не умеешь, срут на тебя мои слуги. Как ты сможешь меня победить?" С этими словами он взял за \
шкирку твою жену и начал ебать ее в жопу с хохотом, держа ее одной рукой за шею и двигая своим огромным \
черным хуем в ее узкую задницу. \
Что будешь делать?
1. Побежать в его сторону с криком " Э сука уебок только я ее могу ебать"
2. Взять снайперскую винтовку и прострелить ему яйца
'''

Liberator13_2='''Ты укусил ее за жопу и она начала срать тебе в рот. Ты наглатался говна до тошноты и тебя \
вырвало прямо ей в жопу. Она не выдержала блевотины руснявого Z-дегенерата и вырубилась. Ты хотел было \
сьебаться нахуй, но решил все же, что должен спасти жену из лап Чорного Азовца. Асвабадитель проследовал \
прямиком в его покои. Чорный Азовец восседал на троне доедал очередного ребенка Донбасса и, как только ты \
потревожил его покой, допил кровь другого ребенка Бомбасса и встал со словами "Ты достойно сражался со всеми \
моими преспешниками и смог победить их. Однако, я НАТОвский Чорный Азовец- из трех маток рожденный, а ты какой \
то деревенский Женек на трех хуях верченый. Я такой Чорный потому что с 16 лет колол боевые стимуляторы НАТО, \
а ты с 16 лет только пиструн свой дрочил на гей порно. Я сру боевым героином НАТО, а ты даже срать не умеешь, \
срут на тебя мои слуги. Как ты сможешь меня победить?" С этими словами он взял за шкирку твою жену и начал \
ебать ее в жопу с хохотом, держа ее одной рукой за шею и двигая своим огромным черным хуем в ее узкую задницу. \
Что будешь делать?
1. Побежать в его сторону с криком " Э сука уебок только я ее могу ебать"
2. Взять снайперскую винтовку и прострелить ему яйца
'''

Liberator14_1='''Русский герой побежал в сторону Азовца с хрюканьем, но был отпизжен его громадной накаченной \
рукой. Азовец принялся ебать жену великого патриота все усиленнее. \
Что будешь делать?
1. Нанести удар ему в анал
2. Дать ему пизды в голову
'''

Liberator14_2=''' Русский герой взял винтовку и метко попал в яйца Азовца. Азовец хрюкнул, но продолжил ебать \
жену Асвободителя. Чтобы восстановиться Чорный Азовец схватил ребенка Донецка с полки и выпил его кровь. \
Яйца сами собой восстановились. \
Азовец принялся ебать жену русского патриота все усиленнее. \
1. Нанести удар ему в анал
2. Дать ему пизды в голову
'''

Liberator15_1='''Асвабадитель решил прострелить анал Азовца. Азовец взвыл от боли и пошатнулся, но продолжил \
ебать Анну Шлюрченко. Асвабадитель понал, что этим ударом снял защиту Азовца. \
Куда бить дальше?
1. В член и яйца
2. В шею и голову
'''

Liberator15_2='''Асвабадитель решил хуякнуть Азовцу в голову. Этот удар не дал вообще ничего, Азовец заебал \
твою жену до потери сознания, после чего посадил вас в клетки и сделал своими рабами. Отныне вы навсегда \
стали игрушками Чорного Азовца и других укранацистов. \
'''

Liberator16_1='''Асвабадитель нанес удар в яйца, а потом в член. Это было слабое место Азовца, он взвыл от \
боли, разломав все окна своим воем. Так вы с женой спаслись и избавили мир от укранацистов. На этом и закончена \
 легенда о Великом Асвабадителе) \
'''

Liberator16_2='''Асвабадитель решил хуякнуть Азовцу в шею, а потом в голову. Этот удар не дал вообще ничего, \
Азовец заебал твою жену до потери сознания, после чего посадил вас в клетки и сделал своими рабами. Отныне \
вы навсегда стали игрушками Чорного Азовца и других укранацистов. \
'''

Liberator = {"0" : {"Text" : [Liberator0], "options" : ["1_1", "1_2"], "buttons": 2},
             "1_1" : {"Text" : [Liberator1_1], "options" : ["2_1", "2_2"], "buttons": 2},
             "1_2" : {"Text" : [Liberator1_2], "options" : ["3_1", "3_2"], "buttons": 2},
             "2_1" : {"Text" : [Liberator2_1], "options" : ["3_1", "3_2"], "buttons": 2},
             "2_2" : {"Text" : [Liberator2_2], "options" : ["3_1", "3_2"], "buttons": 2},
             "3_1" : {"Text" : [Liberator3_1], "options" : ["4_1", "4_2"], "buttons": 2},
             "3_2" : {"Text" : [Liberator3_2], "options" : ["4_1", "4_2"], "buttons": 2},
             "4_1" : {"Text" : [Liberator4_1], "options" : ["5_1", "5_2"], "buttons": 2},
             "4_2" : {"Text" : [Liberator4_2], "options" : ["5_1", "5_2"], "buttons": 2},
             "5_1" : {"Text" : [Liberator5_1], "options" : ["6_1", "6_2"], "buttons": 2},
             "5_2" : {"Text" : [Liberator5_2], "options" : ["6_1", "6_2"], "buttons": 2},
             "6_1" : {"Text" : [Liberator6_1], "options" : ["7_1", "7_2"], "buttons": 2},
             "6_2" : {"Text" : [Liberator6_2], "options" : ["7_1", "7_2"], "buttons": 2},
             "7_1" : {"Text" : [Liberator7_1], "options" : ["8_1", "8_2"], "buttons": 2},
             "7_2" : {"Text" : [Liberator7_2], "options" : ["8_1", "8_2"], "buttons": 2},
             "8_1" : {"Text" : [Liberator8_1], "options" : ["9_1", "9_2"], "buttons": 2},
             "8_2" : {"Text" : [Liberator8_2], "options" : ["9_1", "9_2"], "buttons": 2},
             "9_1" : {"Text" : [Liberator9_1], "options" : ["10_1", "10_2"], "buttons": 2},
             "9_2" : {"Text" : [Liberator9_2], "options" : ["10_1", "10_2"], "buttons": 2},
             "10_1" : {"Text" : [Liberator10_1], "options" : ["11_1", "11_2"], "buttons": 2},
             "10_2" : {"Text" : [Liberator10_2], "options" : ["11_1", "11_2"], "buttons": 2},
             "11_1" : {"Text" : [Liberator11_1], "options" : ["12_1", "12_2"], "buttons": 2},
             "11_2" : {"Text" : [Liberator11_2], "options" : ["12_1", "12_2"], "buttons": 2},
             "12_1" : {"Text" : [Liberator12_1], "options" : ["13_1", "13_2"], "buttons": 2},
             "12_2" : {"Text" : [Liberator12_2], "options" : ["13_1", "13_2"], "buttons": 2},
             "13_1" : {"Text" : [Liberator13_1], "options" : ["14_1", "14_2"], "buttons": 2},
             "13_2" : {"Text" : [Liberator13_2], "options" : ["14_1", "14_2"], "buttons": 2},
             "14_1" : {"Text" : [Liberator14_1], "options" : ["15_1", "15_2"], "buttons": 2},
             "14_2" : {"Text" : [Liberator14_2], "options" : ["15_1", "15_2"], "buttons": 2},
             "15_1" : {"Text" : [Liberator15_1], "options" : ["16_1", "16_2"], "buttons": 2},
             "15_2" : {"Text" : [Liberator15_2], "buttons": 0},
             "16_1" : {"Text" : [Liberator16_1], "buttons": 0},
             "16_2" : {"Text" : [Liberator16_2], "buttons": 0}
             }