Hotel0 = """"Мистический отель"
 В одну чудную зиму ты решила отправиться в горы и выбрала недорогой отель как временное пристанище.
 Доехав до него ты обратила внимание на его мрачный вид и зашла внутрь. Внутри все тоже было мрачно и немного запущено, потому ты побыстрее расплатилась и побежала в свою комнату. Уже подойдя ты обратила внимание на симпатичного парня, который выходил из соседнего номера:)
Спустя пол часа ты была готова укладываться спать, но услышала доносившиеся из соседней комнаты звуки борьбы и постанывания.
Что будешь делать?
1. Выйти из номера и посмотреть что происходит
2. Остаться в номере и продолжить слушать"""

Hotel1_1 = """1. Едва ты вышла из комнаты, как из нее вышло несколько мужиков в масках, волочащих мешок(похоже, в нем находилось чье то тело), но тебе повезло и в темноте они не обратили на тебя внимания
Что будешь делать? 
1. Вернуться в свой номер
2. Пройти в соседний номер
3. Проследить за ними"""

Hotel1_2 = """2. Звуки очень быстро стихли и ты решилась выйти из номера. Едва ты вышла из комнаты, как из соседнего номера вышло несколько мужиков в масках, волочащих мешок(похоже, в нем находилось чье то тело), но тебе повезло и в темноте они не обратили на тебя внимания 
Что будешь делать? 
1. Вернуться в свой номер 
2. Пройти в соседний номер 
3. Проследить за ними"""

Hotel2_1 = """1. Вернувшись в свой номер ты решила лечь спать и это стало для тебя роковой ошибкой. Спустя некоторое время ты очнулась в клетке, немного осмотревшись ты увидела клетки с другими людьми и длинный коридор чуть дальше от себя, которого, похоже, там раньше не было. Так же в нем были следы крови, видимо людей уводят туда. 
Что будешь делать дальше? 
1. Начать рыдать и орать чтобы тебя отпустили 
2. Попытаться вскрыть замок своими ногтями 
3. Ждать принца на белом коне"""

Hotel2_2 = """2. Зайдя в соседний номер, ты увидела следы крови на полу, уходящие в коридор и следы борьбы
Что будешь делать дальше?
1. Поискать в номере еще что то
2. Выйти в коридор"""

Hotel2_3 = """3. Ты тихонько проследовала за ними и увидела, как они затащили мешок в подвал
Что делать дальше? 
1. Спустя в подвал вслед за ними
2. Вернуться назад в свой номер"""

Hotel3_1 = """1. Ты начала тихонько плакать и в ужасе орать чтобы тебя отпустили, это продлилось чуть больше минуты, после чего к тебе подошла охрана и "успокоила" тебя ударом дубинки по лицу
Что будешь делать дальше?
1. Попытаться вскрыть замок своими ногтями 
2. Ждать принца на белом коне"""

Hotel3_2 = """2. Осмотревшись и убедившись, что за тобой не следят, ты начала осторожно царапать замок своими ногтями. Спустя пару минут тебе удалось его вскрыть и решила аккуратно пробраться к проходу, поскольку он не охранялся. Подойдя поближе ты увидела, что он уходит вниз. У тебя было плохое предчувствие, но проход назад охранялся, потому выбора у тебя не было. Пройдя по проходу несколько минут и удивляясь его длине ты наткнулась на 3 открытые двери. Первая из них была стальная, вторая была деревянной, но со стальными вставками, третья была деревянной и слегка подгнившей.
какую из дверей выберешь?
1. 1
2. 2
3. 3"""

Hotel3_3 = """3. Подождав долгое время ты так ничего и не дождалась, но из разговор охраны ты поняла, что отель и его работники состоят в секте и сейчас идет ежегодное жертвоприношение
Что будешь делать дальше?
1. Начать рыдать и орать чтобы тебя отпустили 
2. Попытаться вскрыть замок своими ногтями """

Hotel4_1 = """1. Немного порыскав по комнате ты нашла его телефон, покопавшись в нем ты поняла что он одинок и вышла из комнаты
Что будешь делать дальше?
1. Вернуться в свой номер
2. Проследить за ними"""

Hotel4_2 = """2. Ты решила что больше в комнате ловить нечего и вышла в коридор
Что будешь делать дальше?
1. Вернуться в свой номер 
2. Проследить за ними"""

Hotel5_1 = """1. Ты осторожно прошла в подвал, но тебя тут же земетили. Ты попыталась убежать, но тебя быстро нагнали, скрутили и накинули мешок на голову. Спустя несколько минут ты сидела в клетке, немного осмотревшись ты увидела клетки с другими людьми и длинный коридор чуть дальше от себя, которого, похоже, там раньше не было. Так же в нем были следы крови, видимо людей уводят туда. 
Что будешь делать дальше? 
1. Начать рыдать и орать чтобы тебя отпустили 
2. Попытаться вскрыть замок своими ногтями 
3. Ждать принца на белом коне"""

Hotel6_1 = """1. Ты выбрала стальную дверь, войдя внутрь она резко закрылась на замок, ты немного испугалась и начала осматриваться. Ты увидела узенький коридорчик и слегка приоткрытую дверь впереди. Переборов свой страх ты тихонько пошла вперед и приоткрыла дверь сильнее. Ты увидела стоящих у стены людей и вооруженную охрану, стоящих спиной к тебе, оглядев комнату внимательнее ты увидела пистолет на тумбочке и дверь рядом с ней. Вновь переборов страх ты осторожно прокралась к двери и взяла пистолет с тумбочки
Что делать дальше?
1. Попытаться спасти людей
2. Аккуратно открыть дверь и выйти из комнаты"""

Hotel6_2 = """2. Ты выбрала деревянную дверь со стальными вставками, войдя внутрь она резко закрылась на замок, ты немного испугалась и начала осматриваться. Ты увидела узенький коридорчик и слегка приоткрытую дверь впереди, тут же из за нее раздался крик ужаса, но он быстро стих. Ты очень боялась идти вперед, но делать больше нечего, потому переборов свой страх ты тихонько пошла вперед и приоткрыла дверь сильнее. Ты увидела большую кухню, на столах в которой лежали человеческие тела, люди в форме поваров рубили их на части. В ужасе ты отпрянула от двери, но идти все равно было некуда, потому ты вновь решила осмотреть комнату. Ты увидела дверь чуть впереди тебя я рядом с ней тумбочку, на которой лежал пистолет. Пооглядывавшись еще пару минут ты увидела еще живых напуганных людей в конце комнаты. Слегка приоткрыв дверь ты в ужасе начала осторожно красться к двери. Повара, по видимому, были так увлечены своим делом, что не заметили тебя. Ты подобрала пистолет и замерла в нерешительности
Что делать дальше?
1. Попробовать спасти людей
2. Осторожно выйти в следующий коридор"""

Hotel6_3 = """3. Ты выбрала деревянную подгнившую дверь, как только ты вошла внутрь, она резко закрылась на замок, ты немного испугалась и начала осматриваться. Ты увидела узенький коридорчик и слегка приоткрытую дверь впереди и почувствовала странноватый запах мяса. У тебя было плохое предчувствие и тебе не хотелось идти вперед, но делать было нечего. Подойдя к двери ты слегка приоткрыла е и увидела перед собой части человеческих тел. Едва не блеванув ты закрыла дверь. Спустя пару минут ты все же смогла заставить себя зайти туда, но как только ты приоткрыла дверь из двери сбоку выглянул человек в одежде повора и начал кидать еще частей, немного погодя ты прислушалась и услышала чей то плачь у него из за спины. Так же ты увидела дверь спереди и пистолет лежащий рядом с ней. Как только повар ушел ты шмыгнула к той двери и подобрала пистолет, замерев в нерешительности.
Что будешь делать дальше?
1. Попробовать спасти людей
2. Выйти в следующий коридор"""

Hotel7_1 = """1. Ты набралась храбрости и нацелилась на одного из охранников, но в этот миг послушались шаги за дверью и, едва ты успела вновь спрятаться за тумбочку, их голоса звучали взбешенно и раздраженно, ты поняла, что обнаружилась твоя пропажа и, аккуратно открыв дверь прошмыгнула за нее и увидела еще один узкий коридор с хлипкой дверью в конце. Осмотревшись ты увидела еще 2 двери, по видимому от других 2 дверей в начале. Проверять что в них тебе не захотелось, потому твой выбор не велик.
Что будешь делать дальше?
1. Пройти к хлипкой двери.
2. Спрятаться в уголке и ждать."""

Hotel7_2 = """2. Ты набралась храбрости и уже собралась выйти через дверь рядом, как из коридора послышались шаги в комнату ворвались еще охранники, по голосу они были взбешены и раздражены, потому ты подумала, что обнаружилась твоя пропажа. Ты, открыв дверь, аккуратно прошмыгнула за нее и увидела еще один узкий коридор с хлипкой дверью в конце. Осмотревшись ты увидела еще 2 двери, по видимому от других 2 дверей в начале. Проверять что в них тебе не захотелось, потому твой выбор не велик. 
Что будешь делать дальше? 
1. Пройти к хлипкой двери. 
2. Спрятаться в уголке и ждать."""

Hotel7_3 = """1. Ты решилась и направила пистолет на голову одного повора, но тут же услышала шаги в коридоре, из которого пришла, не долго думая ты прошмыгнула в следующий коридор, прислушавшись ты услышала раздраженные голоса охраны и поняла, что твою пропажу обнаружили. Оглядевшись ты заметила 2 другие двери, по видимому от тех 2 дверей что были позади и хлипкую дверцу в самом конце коридора.
Что будешь делать дальше?
1. Пройти к хлюпкой двери
2. Спрятаться в уголке и ждать."""

Hotel7_4 = """1. Ты решила попытаться спасти кого то помимо себя и уже собиралась подкрасться к той двере, как услышала шаги из коридора, через который пришла. Ты пулей вылетила в соседний коридор и стала прислушиваться. Спустя пол минуты послышались раздраженные голоса охраны, ты поняла что твоя пропажа обнаружилась и в ужасе начала осматриваться. Ты увидела еще 2 двери, по видимому это были выходы из 2 других комнат, и хлюпкую дверку в самом конце.
Что будешь делать дальше?
1. Пройти к хлюпкой двери
2. Спрятаться в уголке и ждать."""

Hotel8_1 = """1. Ты , дрожа от страха, тихонько подошла к хлюпкой дверке, открыв ее ты увидела гигантских размеров темный зал, состоящий красноватой земли и немного красноватого воздуха, по середине зала было небольшое озерко, справа от двери двери была ступенчатая лестница, ведущая к небольшому мостику к озеру, слева был камень, высотой в 2 метра. Спустя небольшое время ты услышала шаги из коридора.
Что делать?
1.Прятаться за камень
2.Побежать к озеру и попытаться спрятаться в нем"""

Hotel9_1 = """1. Ты побежала за камень, хорошенько спрятавшись за ним, ты стала выглядывать из за него и наблюдать за дверью. Охрана не заставила себя долго ждать и, вывалившись из двери, принялась обыскивать зал. Наблюдая за ними несколько минут ты заметила, что они полностью игнорируют камень, за которым ты сидишь. Спустя еще некоторое время из двери вышли 2 человека в мантии, ведущие того самого парня. Они взобрались по лестнице и один из них встал прямо над озером, держа парня за руки, второй стоял рядом с лестнице. Спустя еще пол минуты из двери стали выходить те люди, которых ты видела в клетках, из их разговор ты с ужасом поняла, что ты нужна для проведения ритуала, суть которого в том, что вас с тем парнем должны скормить "богу рыбы". Трясясь от ужаса ты заметила, как человек в мантии, стоящий у лестницы, начал подзывать тебя рукой.
Что делать?
1. Довериться ему и пойти к лестнице
2. Не верить ему и остаться за камнем"""

Hotel9_2 = """2. Ты побежала к реке, но подобравшись по ближе ты почувствовала, что в ней что то обитает и побежала к камню. Едва ты до него добежала, как из двери вывалила охрана и принялась обыскивать зал. Наблюдая за ними несколько минут ты заметила, что они полностью игнорируют камень, за которым ты сидишь. Спустя еще некоторое время из двери вышли 2 человека в мантии, ведущие того самого парня. Они взобрались по лестнице и один из них встал прямо над озером, держа парня за руки, второй стоял рядом с лестнице. Спустя еще пол минуты из двери стали выходить те люди, которых ты видела в клетках, из их разговор ты с ужасом поняла, что ты нужна для проведения ритуала, суть которого в том, что парень должен вырвать из тебя матку и скормить его "богу рыбы". Трясясь от ужаса ты заметила, как человек в мантии, стоящий у лестницы, начал подзывать тебя рукой. 
Что делать? 
1. Довериться ему и пойти к лестнице 
2. Не верить ему и остаться за камнем"""

Hotel10_1 = """1. Ты решила ему довериться и пошла к лестнице. Как только ты дошла до двери тебя начал одолевать саблазм
Что делать дальше?
1. Попытаться выбежать за дверь
2. Продолжить идти к нему"""

Hotel10_2 = """2. Ты не решилась ему довериться, потому он крикнул "ей, проверьте за камнем" и продолжил махать тебе. Ты с ужасом осознала что осталось только 2 варианта.
Что делать дальше?
1. Побежать к двери
2. Довериться ему"""

Hotel11_1 = """1. Ты осторожно подползла к двери, но она была заперта, тебе пришлось взбираться по лестнице. Едва ты дошла до ее половины, загадочный человек нажал на кнопку и нижняя часть лестницы обвалилась, а сам исчез в только что открывшимся проходе за своей спиной. Второй "маг" выхватил пистолет и приставил его к голове парня, ты выхватила свой пистолет, наставила на него и замерла в нерешительности.
что делать? 
1. Выстрелить в него
2. Опустить пистолет"""

Hotel11_2 = """2. Ты решилась пойти к нему по лестнице. Едва ты дошла до ее половины, загадочный человек нажал на кнопку и нижняя часть лестницы обвалилась, а сам исчез в только что открывшимся проходе за своей спиной. Второй "маг" выхватил пистолет и приставил его к голове парня, ты выхватила свой пистолет, наставила на него и замерла в нерешительности.
что делать? 
1. Выстрелить в него
2. Опустить пистолет"""

Hotel12_1 = """1. Ты решилась, прицелилась и выстрелила, попав ему в голову. Тут же вы с парнем сорвались с места и под пулями побежали в отрытый первым "магом" проход.
Он наблюдал за этим и сразу же закрыл тайных ход, как только вы забежали. Вы вместе побежали по ходу и добежали до самого начала тоннеля(там где клетки были), "маг" передал парню свой автомат и с криком "я взорву их, бегите!" закрыл проход(ведущий к 3 дверям).
Вы с парнем добежали до прихожей и вышли из этого ужасного отеля.
Что делать?
1. Обнять парня
2. Отойти от парня подальше"""

Hotel12_2 = """2. Ты со слезами на глазах опустила пистолет, но тут же раздалась автоматная очередь из открывшего прохода и 2 "маг" упал. Тут же вы с парнем сорвались с места и под пулями побежали в отрытый первым "магом" проход. 
Он наблюдал за этим и сразу же закрыл тайных ход, как только вы забежали. Вы вместе побежали по ходу и добежали до самого начала тоннеля(там где клетки были), "маг" передал парню свой автомат и с криком "я взорву их, бегите!" закрыл проход(ведущий к 3 дверям). 
Вы с парнем добежали до прихожей и вышли из этого ужасного отеля. 
Что делать? 
1. Обнять парня 
2. Отойти от парня подальше"""

Hotel13_1 = """1. Ты обняла парня, но этот счастливый момент прервал пистолетный выстрел из отеля, парень мигом оттолкнул тебя и получил пулю в ногу. Ты достала пистолет и застрелила обидчика, которым оказался выживший 2 "маг". 
 Вы с парнем отъехали от отеля, пронаблюдали за красивым взрывом и прожили вместе долгую и счастливую жизнь:D"""

Hotel13_2 = """2. Ты отошла от парня, но тут же раздался выстрел и пуля попала тебе в живот, но парень застрелил обидчика, которым оказался 2 "маг" и оказал тебе первую помощь.
 Вы отъехали подальше от отеля и наблюдали за красивым взрывом, после чего ты внезапно проснулась и поняла, что это был всего лишь сон. Ты собиралась продолжить спать, но услышала доносившиеся из соседней комнаты звуки борьбы и постанывания.
Что будешь делать?
1. Выйти из номера и посмотреть что происходит
2. Остаться в номере и продолжить слушать"""



Mystical_Hotel =   {"0" : {"Text" : [Hotel0], "options" : ['1_1', '1_2'], "buttons" : 2},
                    "1_1" : {"Text" : [Hotel1_1], "options" : ['2_1', '2_2', '2_3'], "buttons" : 3},
                    "1_2" : {"Text" : [Hotel1_2], "options" : ['2_1', '2_2', '2_3'], "buttons" : 3},
                    "2_1" : {"Text": [Hotel2_1], "options": ['3_1', '3_2', '3_3'], "buttons": 3},
                    "2_2" : {"Text": [Hotel2_2], "options": ['4_1', '4_2'], "buttons": 2},
                    "2_3" : {"Text": [Hotel2_3], "options": ['5_1', '2_1'], "buttons": 2},
                    "3_1" : {"Text": [Hotel3_1], "options": ['3_2', '3_3'], "buttons": 2},
                    f"3_2" : {"Text": [Hotel3_2], "options": ['6_1', '6_2', '6_3'], "buttons": 3},
                    "3_3" : {"Text": [Hotel3_3], "options": ['3_1', '3_2'], "buttons": 2},
                    "4_1" : {"Text": [Hotel4_1], "options": ['2_1', '2_3'], "buttons": 2},
                    "4_2" : {"Text": [Hotel4_2], "options": ['2_1', '2_3'], "buttons": 2},
                    "5_1" : {"Text": [Hotel5_1], "options": ['3_1', '3_2', '3_3'], "buttons": 3},
                    "6_1" : {"Text": [Hotel6_1], "options": ['7_1', '7_2'], "buttons": 2},
                    "6_2" : {"Text": [Hotel6_2], "options": ['7_3', '7_2'], "buttons": 2},
                    "6_3" : {"Text": [Hotel6_3], "options": ['7_4', '7_2'], "buttons": 2},
                    "7_1" : {"Text": [Hotel7_1], "options": ['8_1', '7_1'], "buttons": 2},
                    "7_2" : {"Text": [Hotel7_2], "options": ['8_1', '7_2'], "buttons": 2},
                    "7_3" : {"Text": [Hotel7_3], "options": ['8_1', '7_3'], "buttons": 2},
                    "7_4" : {"Text": [Hotel7_4], "options": ['8_1', '7_4'], "buttons": 2},
                    "8_1" : {"Text": [Hotel8_1], "options": ['9_1', '9_2'], "buttons": 2},
                    "9_1" : {"Text": [Hotel9_1], "options": ['10_1', '10_2'], "buttons": 2},
                    "9_2" : {"Text": [Hotel9_2], "options": ['10_1', '10_2'], "buttons": 2},
                    "10_1" : {"Text": [Hotel10_1], "options": ['11_1', '11_2'], "buttons": 2},
                    "10_2" : {"Text": [Hotel10_2], "options": ['11_1', '10_1'], "buttons": 2},
                    "11_1" : {"Text": [Hotel11_1], "options": ['12_1', '12_2'], "buttons": 2},
                    "11_2" : {"Text": [Hotel11_2], "options": ['12_1', '12_2'], "buttons": 2},
                    "12_1" : {"Text": [Hotel12_1], "options": ['13_1', '13_2'], "buttons": 2},
                    "12_2" : {"Text": [Hotel12_2], "options": ['13_1', '13_2'], "buttons": 2},
                    "13_1" : {"Text": [Hotel13_1], "buttons": 0},
                    "13_2" : {"Text": [Hotel13_2], "options" : ['1_1', '1_2'], "buttons" : 2}
                    }